export const mathlesson = [
    {
        title: "Поняття числа",
        content: [
            { type: "text", data: "Число - це математична концепція." },
            {
                type: "list",
                data: [
                    "Натуральні числа",
                    "Цілі числа",
                    "Раціональні числа",
                ],
            },
            {
                type: "ordered-list",
                data: [
                    "Цілі числа включають нуль, позитивні та негативні числа.",
                    "Раціональні числа можна представити у вигляді дробу.",
                ],
            },
        ],
    },
    {
        title: "Операції з числами",
        content: [
            { type: "text", data: "Додавання, віднімання, множення та ділення." },
            {
                type: "table",
                data: [
                    ["Операція", "Результат"],
                    ["Додавання", "a + b"],
                    ["Віднімання", "a - b"],
                    ["Множення", "a * b"],
                    ["Ділення", "a / b"],
                ],
            },
        ],
    },
    {
        title: "Рівняння та нерівності",
        content: [
            {
                type: "text",
                data: "Рівняння та нерівності - це математичні вирази.",
            },
            { type: "image", data: require("../assets/icons/book.png") },
        ],
    },
    {
        title: "Рівняння та нерівності",
        content: [
            {
                type: "text",
                data: "Рівняння та нерівності - це математичні вирази.",
            },
            { type: "image", data: require("../assets/icons/book.png") },
        ],
    }, {
        title: "Рівняння та нерівності",
        content: [
            {
                type: "text",
                data: "Рівняння та нерівності - це математичні вирази.",
            },
            { type: "image", data: require("../assets/icons/book.png") },
        ],
    },
]
